Extensions/УВМ/Documents/УченическийДоговор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УченическийДоговор</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_ТипРасчетаВозмещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаОбязательств</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаУчебы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОбязательств</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияУчебы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обязательства</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/УВМ/Enums/УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Стандартный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноФактическиОтработанномуВремени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/УВМ/Documents/УченическийДоговор/Forms/ФормаДокумента/Ext/Form/Module.bsl
// + БаринбергГМ 20220625 (9837)
// добавлен реквизит, форма и весь функционал по ученическим договорам
// - БаринбергГМ 20220625 (9837)

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("УВМ_ТипРасчетаВозмещения") = Неопределено Тогда
		эТипРасчетаВозмещения = УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ТипРасчетаВозмещения", Элементы.ГруппаОписанияУсловий, Истина, 4, Элементы.ГруппаОбязательства);
		эТипРасчетаВозмещения.УстановитьДействие("ПриИзменении", "УВМ_ТипРасчетаВозмещенияПриИзменении");
		мТипыРасчетаВозмещения = Новый Массив;
		мТипыРасчетаВозмещения.Добавить(Перечисления.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.Стандартный);
		мТипыРасчетаВозмещения.Добавить(Перечисления.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.ПропорциональноФактическиОтработанномуВремени);
		эТипРасчетаВозмещения.СписокВыбора.ЗагрузитьЗначения(мТипыРасчетаВозмещения);
	КонецЕсли;
	
	УВМ_ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УВМ_ТипРасчетаВозмещенияПриИзменении(Элемент)
	
	УВМ_ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура УВМ_ОбновитьВидимостьЭлементовФормы()
	
	Если Объект.УВМ_ТипРасчетаВозмещения = Перечисления.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.ПропорциональноФактическиОтработанномуВремени Тогда
		Элементы.ГруппаОбязательства.Видимость = Ложь;
		Элементы.ДатаОкончанияОбязательств.ТолькоПросмотр = Ложь;
		
		Если Объект.Обязательства.Количество() = 0 Тогда
			Объект.ДатаОкончанияОбязательств = Объект.ДатаНачалаОбязательств;
		Иначе
			ПериодРаботы = 0;
			Для Каждого Обязательство Из Объект.Обязательства Цикл
				ПериодРаботы = Макс(ПериодРаботы, Обязательство.ПериодРаботы);
			КонецЦикла; 
			Объект.ДатаОкончанияОбязательств = ?(ПериодРаботы = 0, '00010101', НачалоДня(ДобавитьМесяц(Объект.ДатаОкончанияУчебы, ПериодРаботы)));
		КонецЕсли;
	Иначе
		Элементы.ГруппаОбязательства.Видимость = Истина;
		Элементы.ДатаОкончанияОбязательств.ТолькоПросмотр = Истина;
		
		ЗаполнитьПоОснованиюНаСервере(Объект.Мероприятие);
		Если Объект.Обязательства.Количество() = 0 Тогда
			Объект.ДатаОкончанияОбязательств = Объект.ДатаНачалаОбязательств;
		Иначе
			ПоследняяСтрока = Объект.Обязательства[Объект.Обязательства.Количество()-1];
			Объект.ДатаОкончанияОбязательств = ПоследняяСтрока.ДатаОкончания;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
